	   IDENTIFICATION DIVISION.
	   PROGRAM-ID. EDITING.
	   ENVIRONMENT DIVISION.
	   DATA DIVISION.
	   WORKING-STORAGE SECTION.
      
      *--------------VARIABLES DE TRABAJO----------------	
	   01 WKS-FIN 		          PIC 9(01).
	   01 WKS-SUELDO              PIC 9(08)V99.
	   01 WKS-SUELDO-EDITADO      PIC $ZZZ,ZZ9.
	   01 WKS-OPCION1             PIC X(01).
	   PROCEDURE DIVISION.
	   INICIO.  
			PERFORM 1000-INICIO.
			PERFORM 2000-PROCESO UNTIL WKS-FIN = 1.
			PERFORM 3000-FIN.
			STOP RUN.
	   1000-INICIO.
			DISPLAY SPACES LINE 01 POSITION 01 ERASE.
			DISPLAY "***************************************".
			DISPLAY "****** NUMERICOS EDITADOS ********".
			DISPLAY "***************************************".
            DISPLAY "INGRESE SU SUELDO ".
			ACCEPT WKS-SUELDO.
	   2000-PROCESO.
	       DISPLAY "SUELDO SIN EDITAR: ".
		   DISPLAY WKS-SUELDO.
           MOVE WKS-SUELDO TO WKS-SUELDO-EDITADO.
           DISPLAY "SUELDO EDITADO: ".
		   DISPLAY WKS-SUELDO-EDITADO.
           DISPLAY "QUIERE HACER OTRA CONSULTA? S/N".
		   ACCEPT WKS-OPCION1.
		   IF WKS-OPCION1 = "S"
		      PERFORM 1000-INICIO
		   ELSE 
		      MOVE 1 TO WKS-FIN. 			  
       3000-FIN.
	       
