	   IDENTIFICATION DIVISION.
	   PROGRAM-ID. OPE-ARIT.
	   ENVIRONMENT DIVISION.
	   DATA DIVISION.
	   WORKING-STORAGE SECTION.
      
      *--------------VARIABLES DE TRABAJO----------------	
	   01 WKS-FIN 		          PIC 9(01).
	   01 WKS-NUMERO1             PIC 9(08)V99.
	   01 WKS-NUMERO2             PIC 9(08)V99.
	   01 WKS-RESULTADO           PIC S9(08)V99.
	   01 WKS-RESULTADO-EDITADO   PIC ZZZ,ZZ9.
	   01 WKS-OPCION              PIC 9(01).
	   01 WKS-OPCION1             PIC X(01).
	   PROCEDURE DIVISION.
	   INICIO.  
			PERFORM 1000-INICIO.
			PERFORM 2000-PROCESO UNTIL WKS-FIN = 1.
			PERFORM 3000-FIN.
			STOP RUN.
	   1000-INICIO.
			DISPLAY SPACES LINE 01 POSITION 01 ERASE.
			DISPLAY "***************************************".
			DISPLAY "****** CALCULADORA ********".
			DISPLAY "***************************************".
			DISPLAY "SUMA (1)".
			DISPLAY "RESTA (2)".
			DISPLAY "MULTIPLICACION(3)".
			DISPLAY "DIVISION (4)".
			DISPLAY "SALIR (0)".
			ACCEPT WKS-OPCION.
			IF WKS-OPCION = 0
			  MOVE 1 TO WKS-FIN.
	   2000-PROCESO.
	       DISPLAY SPACES LINE 01 POSITION 01 ERASE.
	       DISPLAY "INGRESE EL NUMERO 1 ".
		   ACCEPT WKS-NUMERO1.
		   DISPLAY "INGRESE EL NUMERO 2 ".
		   ACCEPT WKS-NUMERO2.
		   IF WKS-OPCION = 1
		     ADD WKS-NUMERO1 TO WKS-NUMERO2 GIVING WKS-RESULTADO
			 MOVE WKS-RESULTADO TO WKS-RESULTADO-EDITADO
			 DISPLAY "EL RESULTADO DE LA DIVISION ES: " 
			   WKS-RESULTADO-EDITADO
		   ELSE 
		     IF WKS-OPCION = 2
			   SUBTRACT WKS-NUMERO1 FROM WKS-NUMERO2 
			   GIVING WKS-RESULTADO
			   MOVE WKS-RESULTADO TO WKS-RESULTADO-EDITADO
			   DISPLAY "EL RESULTADO DE LA RESTA ES: " 
			   WKS-RESULTADO-EDITADO
			 ELSE 
			   IF WKS-OPCION = 3
			     MULTIPLY WKS-NUMERO1 BY WKS-NUMERO2 
				 GIVING WKS-RESULTADO
				 MOVE WKS-RESULTADO TO WKS-RESULTADO-EDITADO
				 DISPLAY "EL RESULTADO DE LA MULTIPLICACION ES: "
				 WKS-RESULTADO-EDITADO
			   ELSE 
			      DIVIDE WKS-NUMERO1 BY WKS-NUMERO2 
				  GIVING WKS-RESULTADO
				  MOVE WKS-RESULTADO TO WKS-RESULTADO-EDITADO
				  DISPLAY "EL RESULTADO DE LA DIVISION ES: " 
				  WKS-RESULTADO-EDITADO.
           DISPLAY "QUIERE HACER OTRA CONSULTA? S/N".
		   ACCEPT WKS-OPCION1.
		   IF WKS-OPCION1 = "S"
		      PERFORM 1000-INICIO
		   ELSE 
		      MOVE 1 TO WKS-FIN. 			  
       3000-FIN.
	       
